# -*- encoding: utf-8 -*-
# Copyright (c) 2003, Taro Ogawa.  All Rights Reserved.
# Copyright (c) 2013, Savoir-faire Linux inc.  All Rights Reserved.

# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
# Lesser General Public License for more details.
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston,
# MA 02110-1301 USA

from __future__ import unicode_literals

from .base import Num2Word_Base


class Num2Word_ML(Num2Word_Base):
    def __init__(self):
        super().__init__()
        # HACK: To be safe, we are clipping at 999, will be
        #       adding proper rules for higher numbers
        self.errmsg_notinrange = "abs(%s) must be less than %s or between %s and %s."

    def setup(self):
        self.corpus = [
            "പൂജ്യം",
            "ഒന്ന്",
            "രണ്ട്",
            "മൂന്ന്",
            "നാല്",
            "അഞ്ച്",
            "ആറ്",
            "ഏഴ്",
            "എട്ട്",
            "ഒൻപത്",
            "പത്ത്",
            "പതിനൊന്ന്",
            "പന്ത്രണ്ട്",
            "പതിമൂന്ന്",
            "പതിനാല്",
            "പതിനഞ്ച്",
            "പതിനാറ്",
            "പതിനേഴ്",
            "പതിനെട്ട്",
            "പത്തൊൻപത്",
            "ഇരുപത്",
            "ഇരുപത്തി ഒന്ന്",
            "ഇരുപത്തി രണ്ട്",
            "ഇരുപത്തി മൂന്ന്",
            "ഇരുപത്തി നാല്",
            "ഇരുപത്തി അഞ്ച്",
            "ഇരുപത്തി ആറ്",
            "ഇരുപത്തി ഏഴ്",
            "ഇരുപത്തി എട്ട്",
            "ഇരുപത്തി ഒൻപത്",
            "മുപ്പത്",
            "മുപ്പത്തി ഒന്ന്",
            "മുപ്പത്തി രണ്ട്",
            "മുപ്പത്തി മൂന്ന്",
            "മുപ്പത്തി നാല്",
            "മുപ്പത്തി അഞ്ച്",
            "മുപ്പത്തി ആറ്",
            "മുപ്പത്തി ഏഴ്",
            "മുപ്പത്തി എട്ട്",
            "മുപ്പത്തി ഒൻപത്",
            "നാൽപ്പത്",
            "നാൽപ്പത്തി ഒന്ന്",
            "നാൽപ്പത്തി രണ്ട്",
            "നാൽപ്പത്തി മൂന്ന്",
            "നാൽപ്പത്തി നാല്",
            "നാൽപ്പത്തി അഞ്ച്",
            "നാൽപ്പത്തി ആറ്",
            "നാൽപ്പത്തി ഏഴ്",
            "നാൽപ്പത്തി എട്ട്",
            "നാൽപ്പത്തി ഒൻപത്",
            "അൻപത്",
            "അൻപത്തി ഒന്ന്",
            "അൻപത്തി രണ്ട്",
            "അൻപത്തി മൂന്ന്",
            "അൻപത്തി നാല്",
            "അൻപത്തി അഞ്ച്",
            "അൻപത്തി ആറ്",
            "അൻപത്തി ഏഴ്",
            "അൻപത്തി എട്ട്",
            "അൻപത്തി ഒൻപത്",
            "അറുപത്",
            "അറുപത്തി ഒന്ന്",
            "അറുപത്തി രണ്ട്",
            "അറുപത്തി മൂന്ന്",
            "അറുപത്തി നാല്",
            "അറുപത്തി അഞ്ച്",
            "അറുപത്തി ആറ്",
            "അറുപത്തി ഏഴ്",
            "അറുപത്തി എട്ട്",
            "അറുപത്തി ഒൻപത്",
            "എഴുപത്",
            "എഴുപത്തി ഒന്ന്",
            "എഴുപത്തി രണ്ട്",
            "എഴുപത്തി മൂന്ന്",
            "എഴുപത്തി നാല്",
            "എഴുപത്തി അഞ്ച്",
            "എഴുപത്തി ആറ്",
            "എഴുപത്തി ഏഴ്",
            "എഴുപത്തി എട്ട്",
            "എഴുപത്തി ഒൻപത്",
            "എൺപത്",
            "എൺപത്തി ഒന്ന്",
            "എൺപത്തി രണ്ട്",
            "എൺപത്തി മൂന്ന്",
            "എൺപത്തി നാല്",
            "എൺപത്തി അഞ്ച്",
            "എൺപത്തി ആറ്",
            "എൺപത്തി ഏഴ്",
            "എൺപത്തി എട്ട്",
            "എൺപത്തി ഒൻപത്",
            "തൊണ്ണൂറ്",
            "തൊണ്ണൂറ്റി ഒന്ന്",
            "തൊണ്ണൂറ്റി രണ്ട്",
            "തൊണ്ണൂറ്റി മൂന്ന്",
            "തൊണ്ണൂറ്റി നാല്",
            "തൊണ്ണൂറ്റി അഞ്ച്",
            "തൊണ്ണൂറ്റി ആറ്",
            "തൊണ്ണൂറ്റി ഏഴ്",
            "തൊണ്ണൂറ്റി എട്ട്",
            "തൊണ്ണൂറ്റി ഒൻപത്",
            "നൂറ്"
        ]

        self.years = {
            1950: "ആയിരത്തി തൊള്ളായിരത്തി അൻപത്",
            1951: "ആയിരത്തി തൊള്ളായിരത്തി അൻപത്തി ഒന്ന്",
            1952: "ആയിരത്തി തൊള്ളായിരത്തി അൻപത്തി രണ്ട്",
            1953: "ആയിരത്തി തൊള്ളായിരത്തി അൻപത്തി മൂന്ന്",
            1954: "ആയിരത്തി തൊള്ളായിരത്തി അൻപത്തി നാല്",
            1955: "ആയിരത്തി തൊള്ളായിരത്തി അൻപത്തി അഞ്ച്",
            1956: "ആയിരത്തി തൊള്ളായിരത്തി അൻപത്തി ആറ്",
            1957: "ആയിരത്തി തൊള്ളായിരത്തി അൻപത്തി ഏഴ്",
            1958: "ആയിരത്തി തൊള്ളായിരത്തി അൻപത്തി എട്ട്",
            1959: "ആയിരത്തി തൊള്ളായിരത്തി അൻപത്തി ഒൻപത്",
            1960: "ആയിരത്തി തൊള്ളായിരത്തി അറുപത്",
            1961: "ആയിരത്തി തൊള്ളായിരത്തി അറുപത്തി ഒന്ന്",
            1962: "ആയിരത്തി തൊള്ളായിരത്തി അറുപത്തി രണ്ട്",
            1963: "ആയിരത്തി തൊള്ളായിരത്തി അറുപത്തി മൂന്ന്",
            1964: "ആയിരത്തി തൊള്ളായിരത്തി അറുപത്തി നാല്",
            1965: "ആയിരത്തി തൊള്ളായിരത്തി അറുപത്തി അഞ്ച്",
            1966: "ആയിരത്തി തൊള്ളായിരത്തി അറുപത്തി ആറ്",
            1967: "ആയിരത്തി തൊള്ളായിരത്തി അറുപത്തി ഏഴ്",
            1968: "ആയിരത്തി തൊള്ളായിരത്തി അറുപത്തി എട്ട്",
            1969: "ആയിരത്തി തൊള്ളായിരത്തി അറുപത്തി ഒൻപത്",
            1970: "ആയിരത്തി തൊള്ളായിരത്തി എഴുപത്",
            1971: "ആയിരത്തി തൊള്ളായിരത്തി എഴുപത്തി ഒന്ന്",
            1972: "ആയിരത്തി തൊള്ളായിരത്തി എഴുപത്തി രണ്ട്",
            1973: "ആയിരത്തി തൊള്ളായിരത്തി എഴുപത്തി മൂന്ന്",
            1974: "ആയിരത്തി തൊള്ളായിരത്തി എഴുപത്തി നാല്",
            1975: "ആയിരത്തി തൊള്ളായിരത്തി എഴുപത്തി അഞ്ച്",
            1976: "ആയിരത്തി തൊള്ളായിരത്തി എഴുപത്തി ആറ്",
            1977: "ആയിരത്തി തൊള്ളായിരത്തി എഴുപത്തി ഏഴ്",
            1978: "ആയിരത്തി തൊള്ളായിരത്തി എഴുപത്തി എട്ട്",
            1979: "ആയിരത്തി തൊള്ളായിരത്തി എഴുപത്തി ഒൻപത്",
            1980: "ആയിരത്തി തൊള്ളായിരത്തി എൺപത്",
            1981: "ആയിരത്തി തൊള്ളായിരത്തി എൺപത്തി ഒന്ന്",
            1982: "ആയിരത്തി തൊള്ളായിരത്തി എൺപത്തി രണ്ട്",
            1983: "ആയിരത്തി തൊള്ളായിരത്തി എൺപത്തി മൂന്ന്",
            1984: "ആയിരത്തി തൊള്ളായിരത്തി എൺപത്തി നാല്",
            1985: "ആയിരത്തി തൊള്ളായിരത്തി എൺപത്തി അഞ്ച്",
            1986: "ആയിരത്തി തൊള്ളായിരത്തി എൺപത്തി ആറ്",
            1987: "ആയിരത്തി തൊള്ളായിരത്തി എൺപത്തി ഏഴ്",
            1988: "ആയിരത്തി തൊള്ളായിരത്തി എൺപത്തി എട്ട്",
            1989: "ആയിരത്തി തൊള്ളായിരത്തി എൺപത്തി ഒൻപത്",
            1990: "ആയിരത്തി തൊള്ളായിരത്തി തൊണ്ണൂറ്",
            1991: "ആയിരത്തി തൊള്ളായിരത്തി തൊണ്ണൂറ്റി ഒന്ന്",
            1992: "ആയിരത്തി തൊള്ളായിരത്തി തൊണ്ണൂറ്റി രണ്ട്",
            1993: "ആയിരത്തി തൊള്ളായിരത്തി തൊണ്ണൂറ്റി മൂന്ന്",
            1994: "ആയിരത്തി തൊള്ളായിരത്തി തൊണ്ണൂറ്റി നാല്",
            1995: "ആയിരത്തി തൊള്ളായിരത്തി തൊണ്ണൂറ്റി അഞ്ച്",
            1996: "ആയിരത്തി തൊള്ളായിരത്തി തൊണ്ണൂറ്റി ആറ്",
            1997: "ആയിരത്തി തൊള്ളായിരത്തി തൊണ്ണൂറ്റി ഏഴ്",
            1998: "ആയിരത്തി തൊള്ളായിരത്തി തൊണ്ണൂറ്റി എട്ട്",
            1999: "ആയിരത്തി തൊള്ളായിരത്തി തൊണ്ണൂറ്റി ഒൻപത്",
            2000: "രണ്ടായിരം",
            2001: "രണ്ടായിരത്തി ഒന്ന്",
            2002: "രണ്ടായിരത്തി രണ്ട്",
            2003: "രണ്ടായിരത്തി മൂന്ന്",
            2004: "രണ്ടായിരത്തി നാല്",
            2005: "രണ്ടായിരത്തി അഞ്ച്",
            2006: "രണ്ടായിരത്തി ആറ്",
            2007: "രണ്ടായിരത്തി ഏഴ്",
            2008: "രണ്ടായിരത്തി എട്ട്",
            2009: "രണ്ടായിരത്തി ഒൻപത്",
            2010: "രണ്ടായിരത്തി പത്ത്",
            2011: "രണ്ടായിരത്തി പതിനൊന്ന്",
            2012: "രണ്ടായിരത്തി പന്ത്രണ്ട്",
            2013: "രണ്ടായിരത്തി പതിമൂന്ന്",
            2014: "രണ്ടായിരത്തി പതിനാല്",
            2015: "രണ്ടായിരത്തി പതിനഞ്ച്",
            2016: "രണ്ടായിരത്തിപതിനാറ്",
            2017: "രണ്ടായിരത്തി പതിനേഴ്",
            2018: "രണ്ടായിരത്തി പതിനെട്ട്",
            2019: "രണ്ടായിരത്തി പത്തൊൻപത്",
            2020: "രണ്ടായിരത്തി ഇരുപത്",
            2021: "രണ്ടായിരത്തി ഇരുപത്തി ഒന്ന്",
            2022: "രണ്ടായിരത്തി ഇരുപത്തി രണ്ട്"
        }

    def to_cardinal(self, value):
        try:
            assert int(value) == value
        except (ValueError, TypeError, AssertionError):
            return self.to_cardinal_float(value)

        if 0 <= value < len(self.corpus):
            return self.corpus[value]

        elif value in self.years.keys():
            return self.years[value]

        else:
            # TODO computing min and max is compute heavy. We probably dont need to do this every time since Python3 has order in keys.
            raise OverflowError(self.errmsg_notinrange % (value, len(self.corpus), min(self.years.keys()), max(self.years.keys())))
